// Задача 10: Напишите программу, которая принимает на вход трёхзначное число 
// и на выходе показывает вторую цифру этого числа.

// 456 -> 5
// 782 -> 8
// 918 -> 1

// Console.Clear();
// Console.Write("Введите трехзначное число ");
// int a = Convert.ToInt32(Console.ReadLine ());
// string b = Convert.ToString (a);
// if (a<99 || a>999)
// {
//     Console.WriteLine("Число не трехзначное");
// }
// else
// {
//     Console.WriteLine("Вторая цифра этого числа " +b[1]);
// }

// Задача 13: Напишите программу, которая выводит третью цифру заданного числа
//  или сообщает, что третьей цифры нет.

// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6

// Console.Clear();
// Console.Write("Введите трехзначное число ");
// int a = Convert.ToInt32(Console.ReadLine ());
// string b = Convert.ToString (a);
// if (a<100)
// {
//     Console.WriteLine("Третьй цифры нет");
// }
// else
// {
//     Console.WriteLine("Вторая цифра этого числа " +b[2]);
// }

// Задача 15: Напишите программу, которая принимает на вход цифру,
//  обозначающую день недели, и проверяет, является ли этот день выходным.

// 6 -> да
// 7 -> да
// 1 -> нет

// Console.Clear();
// Console.Write("Введите цифру, обозначающую день недели ");
// int a = Convert.ToInt32(Console.ReadLine ());
// if (a<=5)
// {
//    Console.WriteLine("Нет");
// }
// else
// {
//    Console.WriteLine("Да");
// }